64g4_2414XY1719JF.txt
Seq1M-Read-Q8: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Write-Q8: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Read: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq1M-Write: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4K-Q32: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-Q32: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Read-4K: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 8 processes
3;fio-3.28;Seq1M-Read-Q8;0;0;1048576;86867;84;12071;581;23796;11739.030938;1255.678339;23713;95456;82332.813433;3119.702199;1.000000%=71827;5.000000%=80216;10.000000%=82313;20.000000%=82313;30.000000%=82313;40.000000%=82313;50.000000%=82313;60.000000%=82313;70.000000%=82313;80.000000%=83361;90.000000%=83361;95.000000%=84410;99.000000%=85458;99.500000%=93847;99.900000%=94896;99.950000%=95944;99.990000%=95944;0%=0;0%=0;0%=0;35363;107185;94074.640293;3225.595417;77913;90292;99.693885%;86601.086957;2238.770501;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.281690%;1.275891%;1026;0;2058;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Seq1M-Write-Q8;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;37540;36;27932;33;62406;27212.091790;3812.817303;29531;248940;190306.916791;22035.222796;1.000000%=160432;5.000000%=162529;10.000000%=164626;20.000000%=166723;30.000000%=173015;40.000000%=183500;50.000000%=187695;60.000000%=200278;70.000000%=204472;80.000000%=208666;90.000000%=219152;95.000000%=223346;99.000000%=231735;99.500000%=233832;99.900000%=240123;99.950000%=248512;99.990000%=248512;0%=0;0%=0;0%=0;61031;280513;217523.425812;24646.024821;22382;45146;99.740059%;37442.418182;4566.865404;0.565680%;0.737532%;1046;0;10;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.10%;0.20%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Seq1M-Read;2;0;1048576;85984;83;12195;85;711;171.854092;22.039062;11253;13927;11717.713273;209.401303;1.000000%=11468;5.000000%=11468;10.000000%=11599;20.000000%=11599;30.000000%=11599;40.000000%=11599;50.000000%=11599;60.000000%=11599;70.000000%=11862;80.000000%=11993;90.000000%=11993;95.000000%=11993;99.000000%=12124;99.500000%=12779;99.900000%=13172;99.950000%=13959;99.990000%=13959;0%=0;0%=0;0%=0;11340;14106;11891.176834;213.170505;83348;88240;100.000000%;86126.666667;1424.599125;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.262424%;1.836969%;1032;0;267;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Seq1M-Write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;34006;33;30835;134;541;261.337434;33.265033;25456;63402;29830.923294;2498.128303;1.000000%=25821;5.000000%=26345;10.000000%=26869;20.000000%=27656;30.000000%=28704;40.000000%=29229;50.000000%=29753;60.000000%=30277;70.000000%=30801;80.000000%=31588;90.000000%=32899;95.000000%=33161;99.000000%=36438;99.500000%=38010;99.900000%=47972;99.950000%=63176;99.990000%=63176;0%=0;0%=0;0%=0;25741;63652;30094.023691;2498.032159;28729;36937;100.000000%;34046.229508;1783.331362;0.651878%;0.483233%;1041;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;99.90%;0.10%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Rand-Read-4K-Q32;4;0;725656;12094;3023;60001;5;1510;325.976917;34.545472;722;11752;10254.056259;260.950009;1.000000%=9764;5.000000%=9895;10.000000%=9895;20.000000%=10027;30.000000%=10158;40.000000%=10158;50.000000%=10289;60.000000%=10289;70.000000%=10420;80.000000%=10420;90.000000%=10551;95.000000%=10682;99.000000%=10813;99.500000%=10944;99.900000%=11337;99.950000%=11468;99.990000%=11599;0%=0;0%=0;0%=0;1081;12096;10580.722548;266.756542;11592;12400;100.000000%;12106.857143;193.506812;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.731667%;5.208333%;181433;0;41;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;15.21%;84.78%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Rand-Write-4K-Q32;5;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;131072;2184;546;60004;62;15457;1808.244306;629.898870;1705;97807;56714.372549;4520.564126;1.000000%=50593;5.000000%=52166;10.000000%=53215;20.000000%=54788;30.000000%=54788;40.000000%=54788;50.000000%=55312;60.000000%=55312;70.000000%=55836;80.000000%=57933;90.000000%=62128;95.000000%=68681;99.000000%=71827;99.500000%=73924;99.900000%=74973;99.950000%=74973;99.990000%=84410;0%=0;0%=0;0%=0;3502;99461;58524.761258;4612.816918;1878;2392;100.000000%;2185.025210;95.685702;1.449928%;4.471443%;32841;0;11;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.02%;0.13%;99.84%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Rand-Read-4K;6;0;698360;11639;2909;60001;5;152;14.600136;4.123947;222;1386;326.271832;34.968822;1.000000%=254;5.000000%=261;10.000000%=272;20.000000%=288;30.000000%=325;40.000000%=329;50.000000%=333;60.000000%=342;70.000000%=346;80.000000%=350;90.000000%=358;95.000000%=362;99.000000%=370;99.500000%=387;99.900000%=468;99.950000%=528;99.990000%=1028;0%=0;0%=0;0%=0;251;1436;341.262952;35.827268;11150;11904;100.000000%;11649.546218;160.805533;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.696667%;6.225000%;174645;0;10;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;99.92%;0.03%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%
3;fio-3.28;Rand-Write-4K;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;127756;2129;532;60002;11;1773;57.752612;10.973753;4;15925;1808.081910;619.857291;1.000000%=1597;5.000000%=1662;10.000000%=1695;20.000000%=1712;30.000000%=1744;40.000000%=1761;50.000000%=1761;60.000000%=1777;70.000000%=1794;80.000000%=1810;90.000000%=1908;95.000000%=1957;99.000000%=2072;99.500000%=2277;99.900000%=14090;99.950000%=14483;99.990000%=15007;0%=0;0%=0;0%=0;1444;15982;1866.803364;619.773307;1883;2372;100.000000%;2131.210084;64.836153;1.451642%;4.459926%;31986;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;97.55%;2.20%;0.00%;0.25%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;358310;66635;3;0;210302;169462;379765;99.52%

Seq1M-Read-Q8: (groupid=0, jobs=1): err= 0: pid=8785: Wed Jul 31 19:28:03 2024
  read: IOPS=84, BW=84.8MiB/s (89.0MB/s)(1024MiB/12071msec)
    slat (usec): min=581, max=23796, avg=11739.03, stdev=1255.68
    clat (usec): min=23713, max=95456, avg=82332.81, stdev=3119.70
     lat (msec): min=35, max=107, avg=94.07, stdev= 3.23
    clat percentiles (usec):
     |  1.00th=[71828],  5.00th=[80217], 10.00th=[82314], 20.00th=[82314],
     | 30.00th=[82314], 40.00th=[82314], 50.00th=[82314], 60.00th=[82314],
     | 70.00th=[82314], 80.00th=[83362], 90.00th=[83362], 95.00th=[84411],
     | 99.00th=[85459], 99.50th=[93848], 99.90th=[94897], 99.95th=[95945],
     | 99.99th=[95945]
   bw (  KiB/s): min=77913, max=90292, per=99.69%, avg=86601.09, stdev=2238.77, samples=23
   iops        : min=   76, max=   88, avg=84.43, stdev= 2.17, samples=23
  lat (msec)   : 50=0.29%, 100=99.71%
  cpu          : usr=0.28%, sys=1.28%, ctx=1026, majf=0, minf=2058
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Write-Q8: (groupid=1, jobs=1): err= 0: pid=8789: Wed Jul 31 19:28:03 2024
  write: IOPS=36, BW=36.7MiB/s (38.4MB/s)(1024MiB/27932msec); 0 zone resets
    slat (usec): min=33, max=62406, avg=27212.09, stdev=3812.82
    clat (msec): min=29, max=248, avg=190.31, stdev=22.04
     lat (msec): min=61, max=280, avg=217.52, stdev=24.65
    clat percentiles (msec):
     |  1.00th=[  161],  5.00th=[  163], 10.00th=[  165], 20.00th=[  167],
     | 30.00th=[  174], 40.00th=[  184], 50.00th=[  188], 60.00th=[  201],
     | 70.00th=[  205], 80.00th=[  209], 90.00th=[  220], 95.00th=[  224],
     | 99.00th=[  232], 99.50th=[  234], 99.90th=[  241], 99.95th=[  249],
     | 99.99th=[  249]
   bw (  KiB/s): min=22382, max=45146, per=99.74%, avg=37442.42, stdev=4566.87, samples=55
   iops        : min=   21, max=   44, avg=36.49, stdev= 4.50, samples=55
  lat (msec)   : 50=0.10%, 100=0.20%, 250=99.71%
  cpu          : usr=0.57%, sys=0.74%, ctx=1046, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Read: (groupid=2, jobs=1): err= 0: pid=8793: Wed Jul 31 19:28:03 2024
  read: IOPS=83, BW=84.0MiB/s (88.0MB/s)(1024MiB/12195msec)
    slat (usec): min=85, max=711, avg=171.85, stdev=22.04
    clat (usec): min=11253, max=13927, avg=11717.71, stdev=209.40
     lat (usec): min=11340, max=14106, avg=11891.18, stdev=213.17
    clat percentiles (usec):
     |  1.00th=[11469],  5.00th=[11469], 10.00th=[11600], 20.00th=[11600],
     | 30.00th=[11600], 40.00th=[11600], 50.00th=[11600], 60.00th=[11600],
     | 70.00th=[11863], 80.00th=[11994], 90.00th=[11994], 95.00th=[11994],
     | 99.00th=[12125], 99.50th=[12780], 99.90th=[13173], 99.95th=[13960],
     | 99.99th=[13960]
   bw (  KiB/s): min=83348, max=88240, per=100.00%, avg=86126.67, stdev=1424.60, samples=24
   iops        : min=   81, max=   86, avg=83.96, stdev= 1.40, samples=24
  lat (msec)   : 20=100.00%
  cpu          : usr=0.26%, sys=1.84%, ctx=1032, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq1M-Write: (groupid=3, jobs=1): err= 0: pid=8794: Wed Jul 31 19:28:03 2024
  write: IOPS=33, BW=33.2MiB/s (34.8MB/s)(1024MiB/30835msec); 0 zone resets
    slat (usec): min=134, max=541, avg=261.34, stdev=33.27
    clat (usec): min=25456, max=63402, avg=29830.92, stdev=2498.13
     lat (usec): min=25741, max=63652, avg=30094.02, stdev=2498.03
    clat percentiles (usec):
     |  1.00th=[25822],  5.00th=[26346], 10.00th=[26870], 20.00th=[27657],
     | 30.00th=[28705], 40.00th=[29230], 50.00th=[29754], 60.00th=[30278],
     | 70.00th=[30802], 80.00th=[31589], 90.00th=[32900], 95.00th=[33162],
     | 99.00th=[36439], 99.50th=[38011], 99.90th=[47973], 99.95th=[63177],
     | 99.99th=[63177]
   bw (  KiB/s): min=28729, max=36937, per=100.00%, avg=34046.23, stdev=1783.33, samples=61
   iops        : min=   28, max=   36, avg=33.18, stdev= 1.73, samples=61
  lat (msec)   : 50=99.90%, 100=0.10%
  cpu          : usr=0.65%, sys=0.48%, ctx=1041, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-Q32: (groupid=4, jobs=1): err= 0: pid=8798: Wed Jul 31 19:28:03 2024
  read: IOPS=3023, BW=11.8MiB/s (12.4MB/s)(709MiB/60001msec)
    slat (usec): min=5, max=1510, avg=325.98, stdev=34.55
    clat (usec): min=722, max=11752, avg=10254.06, stdev=260.95
     lat (usec): min=1081, max=12096, avg=10580.72, stdev=266.76
    clat percentiles (usec):
     |  1.00th=[ 9765],  5.00th=[ 9896], 10.00th=[ 9896], 20.00th=[10028],
     | 30.00th=[10159], 40.00th=[10159], 50.00th=[10290], 60.00th=[10290],
     | 70.00th=[10421], 80.00th=[10421], 90.00th=[10552], 95.00th=[10683],
     | 99.00th=[10814], 99.50th=[10945], 99.90th=[11338], 99.95th=[11469],
     | 99.99th=[11600]
   bw (  KiB/s): min=11592, max=12400, per=100.00%, avg=12106.86, stdev=193.51, samples=119
   iops        : min= 2898, max= 3100, avg=3026.64, stdev=48.48, samples=119
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=15.21%, 20=84.78%
  cpu          : usr=1.73%, sys=5.21%, ctx=181433, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=181414,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-Q32: (groupid=5, jobs=1): err= 0: pid=8799: Wed Jul 31 19:28:03 2024
  write: IOPS=546, BW=2184KiB/s (2237kB/s)(128MiB/60004msec); 0 zone resets
    slat (usec): min=62, max=15457, avg=1808.24, stdev=629.90
    clat (usec): min=1705, max=97807, avg=56714.37, stdev=4520.56
     lat (usec): min=3502, max=99461, avg=58524.76, stdev=4612.82
    clat percentiles (usec):
     |  1.00th=[50594],  5.00th=[52167], 10.00th=[53216], 20.00th=[54789],
     | 30.00th=[54789], 40.00th=[54789], 50.00th=[55313], 60.00th=[55313],
     | 70.00th=[55837], 80.00th=[57934], 90.00th=[62129], 95.00th=[68682],
     | 99.00th=[71828], 99.50th=[73925], 99.90th=[74974], 99.95th=[74974],
     | 99.99th=[84411]
   bw (  KiB/s): min= 1878, max= 2392, per=100.00%, avg=2185.03, stdev=95.69, samples=119
   iops        : min=  469, max=  598, avg=546.23, stdev=23.99, samples=119
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=0.13%
  lat (msec)   : 100=99.84%
  cpu          : usr=1.45%, sys=4.47%, ctx=32841, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Read-4K: (groupid=6, jobs=1): err= 0: pid=8803: Wed Jul 31 19:28:03 2024
  read: IOPS=2909, BW=11.4MiB/s (11.9MB/s)(682MiB/60001msec)
    slat (usec): min=5, max=152, avg=14.60, stdev= 4.12
    clat (usec): min=222, max=1386, avg=326.27, stdev=34.97
     lat (usec): min=251, max=1436, avg=341.26, stdev=35.83
    clat percentiles (usec):
     |  1.00th=[  255],  5.00th=[  262], 10.00th=[  273], 20.00th=[  289],
     | 30.00th=[  326], 40.00th=[  330], 50.00th=[  334], 60.00th=[  343],
     | 70.00th=[  347], 80.00th=[  351], 90.00th=[  359], 95.00th=[  363],
     | 99.00th=[  371], 99.50th=[  388], 99.90th=[  469], 99.95th=[  529],
     | 99.99th=[ 1029]
   bw (  KiB/s): min=11150, max=11904, per=100.00%, avg=11649.55, stdev=160.81, samples=119
   iops        : min= 2787, max= 2976, avg=2912.05, stdev=40.16, samples=119
  lat (usec)   : 250=0.02%, 500=99.92%, 750=0.03%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.70%, sys=6.22%, ctx=174645, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=174590,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=7, jobs=1): err= 0: pid=8804: Wed Jul 31 19:28:03 2024
  write: IOPS=532, BW=2129KiB/s (2180kB/s)(125MiB/60002msec); 0 zone resets
    slat (usec): min=11, max=1773, avg=57.75, stdev=10.97
    clat (usec): min=4, max=15925, avg=1808.08, stdev=619.86
     lat (usec): min=1444, max=15982, avg=1866.80, stdev=619.77
    clat percentiles (usec):
     |  1.00th=[ 1598],  5.00th=[ 1663], 10.00th=[ 1696], 20.00th=[ 1713],
     | 30.00th=[ 1745], 40.00th=[ 1762], 50.00th=[ 1762], 60.00th=[ 1778],
     | 70.00th=[ 1795], 80.00th=[ 1811], 90.00th=[ 1909], 95.00th=[ 1958],
     | 99.00th=[ 2073], 99.50th=[ 2278], 99.90th=[14091], 99.95th=[14484],
     | 99.99th=[15008]
   bw (  KiB/s): min= 1883, max= 2372, per=100.00%, avg=2131.21, stdev=64.84, samples=119
   iops        : min=  470, max=  593, avg=532.79, stdev=16.25, samples=119
  lat (usec)   : 10=0.01%
  lat (msec)   : 2=97.55%, 4=2.20%, 20=0.25%
  cpu          : usr=1.45%, sys=4.46%, ctx=31986, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,31939,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=84.8MiB/s (89.0MB/s), 84.8MiB/s-84.8MiB/s (89.0MB/s-89.0MB/s), io=1024MiB (1074MB), run=12071-12071msec

Run status group 1 (all jobs):
  WRITE: bw=36.7MiB/s (38.4MB/s), 36.7MiB/s-36.7MiB/s (38.4MB/s-38.4MB/s), io=1024MiB (1074MB), run=27932-27932msec

Run status group 2 (all jobs):
   READ: bw=84.0MiB/s (88.0MB/s), 84.0MiB/s-84.0MiB/s (88.0MB/s-88.0MB/s), io=1024MiB (1074MB), run=12195-12195msec

Run status group 3 (all jobs):
  WRITE: bw=33.2MiB/s (34.8MB/s), 33.2MiB/s-33.2MiB/s (34.8MB/s-34.8MB/s), io=1024MiB (1074MB), run=30835-30835msec

Run status group 4 (all jobs):
   READ: bw=11.8MiB/s (12.4MB/s), 11.8MiB/s-11.8MiB/s (12.4MB/s-12.4MB/s), io=709MiB (743MB), run=60001-60001msec

Run status group 5 (all jobs):
  WRITE: bw=2184KiB/s (2237kB/s), 2184KiB/s-2184KiB/s (2237kB/s-2237kB/s), io=128MiB (134MB), run=60004-60004msec

Run status group 6 (all jobs):
   READ: bw=11.4MiB/s (11.9MB/s), 11.4MiB/s-11.4MiB/s (11.9MB/s-11.9MB/s), io=682MiB (715MB), run=60001-60001msec

Run status group 7 (all jobs):
  WRITE: bw=2129KiB/s (2180kB/s), 2129KiB/s-2129KiB/s (2180kB/s-2180kB/s), io=125MiB (131MB), run=60002-60002msec

Disk stats (read/write):
  sdb: ios=358310/66635, merge=3/0, ticks=210302/169462, in_queue=379765, util=99.52%